#include <iostream>
#include <cmath>
//АРИФМЕТИЧНІ ТА БІТОВІ ОПЕРАЦІЇ В С++. РЕАЛІЗАЦІЯ СТРУКТУР ВИБОРУ.
using namespace std;

int main() {
	setlocale(LC_ALL, "ru");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 1 -----\n\n";
	
	double a{}, b{};
	cout << "a -> "; cin >> a;
	cout << "b -> "; cin >> b;
	double S = a * b;
	cout << "S = " << S << endl;


	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 2 -----\n\n";

	double sum{}, rate{}, res{}, term{};
	cout << "Сума вкладу -> "; cin >> sum;
	cout << "Процентна  ставка -> "; cin >> rate;
	cout << "Термiн вкладу -> "; cin >> term;
	res = sum * (rate * term / 12 / 100);
	cout << "Дохiд за вкладом = " << res << endl;
	

	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 3 -----\n\n";

	double c{}, d{};
	cout << "Введiть число -> "; cin >> c;
	cout << "Введiть число -> "; cin >> d;
	if (c > d)
		cout << c << " > " << d << endl;
	else if (c < d)
		cout << c << " < " << d << endl;
	else
		cout << c << " = " << d << endl;


	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 4 -----\n\n";

	//double c{}, d{};
	cout << "Введiть число -> "; cin >> c;
	cout << "Введiть число -> "; cin >> d;
	if (c > d)
		cout << c << " > " << d << endl;
	else if (c < d)
		cout << c << " < " << d << endl;
	else
		cout << c << " = " << d << endl;


	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 5 -----\n\n";

	int age{};
	cout << "Введiть вiк претендента -> "; cin >> age;
	if (age >= 25 && age <= 40)
		cout << "Претендент пiдходить" << endl;
	else
		cout << "Претендент не пiдходить" << endl;


	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 6 -----\n\n";

	//double a{}, b{}, c{}, d{};
	cout << "a -> "; cin >> a;
	cout << "b -> "; cin >> b;
	cout << "c -> "; cin >> c;
	d = (b * b) - 4 * a * c;
	if (d < 0)	//1, 5, 8 -> немає;
		cout << "Розв'язкiв немає" << endl;
	else if (d == 0) {	//3, -18, 27 -> х=3;
		double x = -b / (2 * a);
		cout << "x = " << x << endl;
	}
	else {	//5, 6, 1 -> х1=-0.2, х2=-1;
		double x1 = (-b + sqrt(d)) / (2 * a);
		double x2 = (-b - sqrt(d)) / (2 * a);
		cout << "x1 = " << x1 << "\tx2 = " << x2 << endl;
	}


	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 7 -----\n\n";

	int num{};
	cout << "Введiть число -> "; cin >> num;
	for (int i = 0; i < 10; i++)
		cout << num << " * " << i << " = " << num * i << endl;


	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 8 -----\n\n";

	int e{}, f{};
	cout << "Введiть число -> "; cin >> e;
	cout << "Введiть число -> "; cin >> f;
	for (int i = min(e,f); i > 0; i--) {
		if (e % i == 0 && f % i == 0) {
			cout << "Найбiльший загальний дiльник = " << i << endl;
			break;
		}
	}


	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 9 -----\n\n";

	double x{};
	cout << "Введiть x -> "; cin >> x;
	if (x <= 0)
		cout << "f(x) = 0" << endl;
	else if (x > 0 && x <= 1)
		cout << "f(x) = " << x * x - x << endl;
	else
		cout << "f(x) = " << x * x - sin(3.14 * pow(x, 2)) << endl;


	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 10 -----\n\n";

	int year{};
	cout << "Введiть рiк -> "; cin >> year;
	switch (year % 12) {
	case 0:
		cout << "рiк мавпи";	break;
	case 1:
		cout << "рiк пiвня";	break;
	case 2:
		cout << "рiк собаки";	break;
	case 3:
		cout << "рiк свинi";	break;
	case 4:
		cout << "рiк щура";		break;
	case 5:
		cout << "рiк корови";	break;
	case 6:
		cout << "рiк тигру";	break;
	case 7:
		cout << "рiк зайця";	break;
	case 8:
		cout << "рiк дракона";	break;
	case 9:
		cout << "рiк змiї";		break;
	case 10:
		cout << "рiк коня";		break;
	case 11:
		cout << "рiк вiвцi";	break;
	}
	cout << endl;


	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 11 -----\n\n";

	int h{}, w{};
	cout << "Введiть висоту -> "; cin >> h;
	cout << "Введiть ширину -> "; cin >> w;
	for (int i = 0; i < h; i++) {
		for (int j = 0; j < w; j++) {
			cout << " *";
		}
		cout << endl;
	}


	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n----- Завдання 12 -----\n\n";

	int n{}, sumN{};
	cout << "Введiть цiле число -> "; cin >> n;
	while (n != 0) {
		sumN += n % 10;
		n /= 10;
	}
	cout << "Cума цифр = " << sumN << endl;


	cout << "\n\n\n"; system("Pause");
//-------------------------------------------------------------------------------------------------------------- -
	cout << "\n\n----- Завдання 13 -----\n\n";

	int m{}, num1{};
	cout << "Введiть цiле число -> "; cin >> m;
	while (m != 0) {
		if (m % 2 == 1)
			num1++;
		m = m / 2;
	}
	cout << "Кiлькiсть одиниць у двiйковому записi = " << num1 << endl;


	cout << "\n\n\n"; system("Pause");
//---------------------------------------------------------------------------------------------------------------
	cout << "\n\n\n\n\n";
	return 0;
}